Grooming/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Grooming/src/Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ответственный.Пустая() Тогда 
		Объект.Ответственный  = УзнатьТекущегоПользователяКлиент.УзнатьТекущегоПользователя();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	Если Объект.СкладОтправитель = Объект.СкладПолучатель Тогда
		ВыводПредупрежденияПоСкладам();	
		Объект.СкладОтправитель = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	Если Объект.СкладОтправитель = Объект.СкладПолучатель Тогда
		ВыводПредупрежденияПоСкладам();
		Объект.СкладПолучатель = Неопределено; 
	КонецЕсли; 
КонецПроцедуры  

Процедура ВыводПредупрежденияПоСкладам() 
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Склад Отправитель не может быть Получателем!!!";
	Сообщение.Сообщить();	
	
КонецПроцедуры
